garyPenhook/PIC-Assembler/device_includes/pic16f17154.inc
// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 01C8Dh
// bitfield definitions
NVMADRH_NVMADR_POSN                      equ 0000h
NVMADRH_NVMADR_POSITION                  equ 0000h
NVMADRH_NVMADR_SIZE                      equ 0007h
NVMADRH_NVMADR_LENGTH                    equ 0007h
NVMADRH_NVMADR_MASK                      equ 007Fh
NVMADRH_NVMADR8_POSN                     equ 0000h
NVMADRH_NVMADR8_POSITION                 equ 0000h
NVMADRH_NVMADR8_SIZE                     equ 0001h
NVMADRH_NVMADR8_LENGTH                   equ 0001h
NVMADRH_NVMADR8_MASK                     equ 0001h
NVMADRH_NVMADR9_POSN                     equ 0001h
NVMADRH_NVMADR9_POSITION                 equ 0001h
NVMADRH_NVMADR9_SIZE                     equ 0001h
NVMADRH_NVMADR9_LENGTH                   equ 0001h
NVMADRH_NVMADR9_MASK                     equ 0002h
NVMADRH_NVMADR10_POSN                    equ 0002h
NVMADRH_NVMADR10_POSITION                equ 0002h
NVMADRH_NVMADR10_SIZE                    equ 0001h
NVMADRH_NVMADR10_LENGTH                  equ 0001h
NVMADRH_NVMADR10_MASK                    equ 0004h
NVMADRH_NVMADR11_POSN                    equ 0003h
NVMADRH_NVMADR11_POSITION                equ 0003h
NVMADRH_NVMADR11_SIZE                    equ 0001h
NVMADRH_NVMADR11_LENGTH                  equ 0001h
NVMADRH_NVMADR11_MASK                    equ 0008h
NVMADRH_NVMADR12_POSN                    equ 0004h
NVMADRH_NVMADR12_POSITION                equ 0004h
NVMADRH_NVMADR12_SIZE                    equ 0001h
NVMADRH_NVMADR12_LENGTH                  equ 0001h
NVMADRH_NVMADR12_MASK                    equ 0010h
NVMADRH_NVMADR13_POSN                    equ 0005h
NVMADRH_NVMADR13_POSITION                equ 0005h
NVMADRH_NVMADR13_SIZE                    equ 0001h
NVMADRH_NVMADR13_LENGTH                  equ 0001h
NVMADRH_NVMADR13_MASK                    equ 0020h
NVMADRH_NVMADR14_POSN                    equ 0006h
NVMADRH_NVMADR14_POSITION                equ 0006h
NVMADRH_NVMADR14_SIZE                    equ 0001h
NVMADRH_NVMADR14_LENGTH                  equ 0001h
NVMADRH_NVMADR14_MASK                    equ 0040h

// Register: NVMDATL
#define NVMDATL NVMDATL
NVMDATL                                  equ 01C8Eh
// bitfield definitions
NVMDATL_NVMDAT_POSN                      equ 0000h
NVMDATL_NVMDAT_POSITION                  equ 0000h
NVMDATL_NVMDAT_SIZE                      equ 0008h
NVMDATL_NVMDAT_LENGTH                    equ 0008h
NVMDATL_NVMDAT_MASK                      equ 00FFh
NVMDATL_NVMDAT0_POSN                     equ 0000h
NVMDATL_NVMDAT0_POSITION                 equ 0000h
NVMDATL_NVMDAT0_SIZE                     equ 0001h
NVMDATL_NVMDAT0_LENGTH                   equ 0001h
NVMDATL_NVMDAT0_MASK                     equ 0001h
NVMDATL_NVMDAT1_POSN                     equ 0001h
NVMDATL_NVMDAT1_POSITION                 equ 0001h
NVMDATL_NVMDAT1_SIZE                     equ 0001h
NVMDATL_NVMDAT1_LENGTH                   equ 0001h
NVMDATL_NVMDAT1_MASK                     equ 0002h
NVMDATL_NVMDAT2_POSN                     equ 0002h
NVMDATL_NVMDAT2_POSITION                 equ 0002h
NVMDATL_NVMDAT2_SIZE                     equ 0001h
NVMDATL_NVMDAT2_LENGTH                   equ 0001h
NVMDATL_NVMDAT2_MASK                     equ 0004h
NVMDATL_NVMDAT3_POSN                     equ 0003h
NVMDATL_NVMDAT3_POSITION                 equ 0003h
NVMDATL_NVMDAT3_SIZE                     equ 0001h
NVMDATL_NVMDAT3_LENGTH                   equ 0001h
NVMDATL_NVMDAT3_MASK                     equ 0008h
NVMDATL_NVMDAT4_POSN                     equ 0004h
NVMDATL_NVMDAT4_POSITION                 equ 0004h
NVMDATL_NVMDAT4_SIZE                     equ 0001h
NVMDATL_NVMDAT4_LENGTH                   equ 0001h
NVMDATL_NVMDAT4_MASK                     equ 0010h
NVMDATL_NVMDAT5_POSN                     equ 0005h
NVMDATL_NVMDAT5_POSITION                 equ 0005h
NVMDATL_NVMDAT5_SIZE                     equ 0001h
NVMDATL_NVMDAT5_LENGTH                   equ 0001h
NVMDATL_NVMDAT5_MASK                     equ 0020h
NVMDATL_NVMDAT6_POSN                     equ 0006h
NVMDATL_NVMDAT6_POSITION                 equ 0006h
NVMDATL_NVMDAT6_SIZE                     equ 0001h
NVMDATL_NVMDAT6_LENGTH                   equ 0001h
NVMDATL_NVMDAT6_MASK                     equ 0040h
NVMDATL_NVMDAT7_POSN                     equ 0007h
NVMDATL_NVMDAT7_POSITION                 equ 0007h
NVMDATL_NVMDAT7_SIZE                     equ 0001h
NVMDATL_NVMDAT7_LENGTH                   equ 0001h
NVMDATL_NVMDAT7_MASK                     equ 0080h

// Register: NVMDATH
#define NVMDATH NVMDATH
NVMDATH                                  equ 01C8Fh
// bitfield definitions
NVMDATH_NVMDAT_POSN                      equ 0000h
NVMDATH_NVMDAT_POSITION                  equ 0000h
NVMDATH_NVMDAT_SIZE                      equ 0006h
NVMDATH_NVMDAT_LENGTH                    equ 0006h
NVMDATH_NVMDAT_MASK                      equ 003Fh
NVMDATH_NVMDAT8_POSN                     equ 0000h
NVMDATH_NVMDAT8_POSITION                 equ 0000h
NVMDATH_NVMDAT8_SIZE                     equ 0001h
NVMDATH_NVMDAT8_LENGTH                   equ 0001h
NVMDATH_NVMDAT8_MASK                     equ 0001h
NVMDATH_NVMDAT9_POSN                     equ 0001h
NVMDATH_NVMDAT9_POSITION                 equ 0001h
NVMDATH_NVMDAT9_SIZE                     equ 0001h
NVMDATH_NVMDAT9_LENGTH                   equ 0001h
NVMDATH_NVMDAT9_MASK                     equ 0002h
NVMDATH_NVMDAT10_POSN                    equ 0002h
NVMDATH_NVMDAT10_POSITION                equ 0002h
NVMDATH_NVMDAT10_SIZE                    equ 0001h
NVMDATH_NVMDAT10_LENGTH                  equ 0001h
NVMDATH_NVMDAT10_MASK                    equ 0004h
NVMDATH_NVMDAT11_POSN                    equ 0003h
NVMDATH_NVMDAT11_POSITION                equ 0003h
NVMDATH_NVMDAT11_SIZE                    equ 0001h
NVMDATH_NVMDAT11_LENGTH                  equ 0001h
NVMDATH_NVMDAT11_MASK                    equ 0008h
NVMDATH_NVMDAT12_POSN                    equ 0004h
NVMDATH_NVMDAT12_POSITION                equ 0004h
NVMDATH_NVMDAT12_SIZE                    equ 0001h
NVMDATH_NVMDAT12_LENGTH                  equ 0001h
NVMDATH_NVMDAT12_MASK                    equ 0010h
NVMDATH_NVMDAT13_POSN                    equ 0005h
NVMDATH_NVMDAT13_POSITION                equ 0005h
NVMDATH_NVMDAT13_SIZE                    equ 0001h
NVMDATH_NVMDAT13_LENGTH                  equ 0001h
NVMDATH_NVMDAT13_MASK                    equ 0020h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 01C90h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_LWLO_POSN                        equ 0005h
NVMCON1_LWLO_POSITION                    equ 0005h
NVMCON1_LWLO_SIZE                        equ 0001h
NVMCON1_LWLO_LENGTH                      equ 0001h
NVMCON1_LWLO_MASK                        equ 0020h
NVMCON1_NVMREGS_POSN                     equ 0006h
NVMCON1_NVMREGS_POSITION                 equ 0006h
NVMCON1_NVMREGS_SIZE                     equ 0001h
NVMCON1_NVMREGS_LENGTH                   equ 0001h
NVMCON1_NVMREGS_MASK                     equ 0040h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 01C91h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

// Register: SCANHADRL
#define SCANHADRL SCANHADRL
SCANHADRL                                equ 01C92h
// bitfield definitions
SCANHADRL_SCANHADRL_POSN                 equ 0000h
SCANHADRL_SCANHADRL_POSITION             equ 0000h
SCANHADRL_SCANHADRL_SIZE                 equ 0008h
SCANHADRL_SCANHADRL_LENGTH               equ 0008h
SCANHADRL_SCANHADRL_MASK                 equ 00FFh
SCANHADRL_ADRL_POSN                      equ 0000h
SCANHADRL_ADRL_POSITION                  equ 0000h
SCANHADRL_ADRL_SIZE                      equ 0008h
SCANHADRL_ADRL_LENGTH                    equ 0008h
SCANHADRL_ADRL_MASK                      equ 00FFh

// Register: SCANHADRH
#define SCANHADRH SCANHADRH
SCANHADRH                                equ 01C93h
// bitfield definitions
SCANHADRH_SCANHADRH_POSN                 equ 0000h
SCANHADRH_SCANHADRH_POSITION             equ 0000h
SCANHADRH_SCANHADRH_SIZE                 equ 0008h
SCANHADRH_SCANHADRH_LENGTH               equ 0008h
SCANHADRH_SCANHADRH_MASK                 equ 00FFh
SCANHADRH_ADRH_POSN                      equ 0000h
SCANHADRH_ADRH_POSITION                  equ 0000h
SCANHADRH_ADRH_SIZE                      equ 0008h
SCANHADRH_ADRH_LENGTH                    equ 0008h
SCANHADRH_ADRH_MASK                      equ 00FFh

// Register: SCANLADRL
#define SCANLADRL SCANLADRL
SCANLADRL                                equ 01C95h
// bitfield definitions
SCANLADRL_SCANLADRL_POSN                 equ 0000h
SCANLADRL_SCANLADRL_POSITION             equ 0000h
SCANLADRL_SCANLADRL_SIZE                 equ 0008h
SCANLADRL_SCANLADRL_LENGTH               equ 0008h
SCANLADRL_SCANLADRL_MASK                 equ 00FFh
SCANLADRL_ADRL_POSN                      equ 0000h
SCANLADRL_ADRL_POSITION                  equ 0000h
SCANLADRL_ADRL_SIZE                      equ 0008h
SCANLADRL_ADRL_LENGTH                    equ 0008h
SCANLADRL_ADRL_MASK                      equ 00FFh

// Register: SCANLADRH
#define SCANLADRH SCANLADRH
SCANLADRH                                equ 01C96h
// bitfield definitions
SCANLADRH_SCANLADRH_POSN                 equ 0000h
SCANLADRH_SCANLADRH_POSITION             equ 0000h
SCANLADRH_SCANLADRH_SIZE                 equ 0008h
SCANLADRH_SCANLADRH_LENGTH               equ 0008h
SCANLADRH_SCANLADRH_MASK                 equ 00FFh
SCANLADRH_ADRH_POSN                      equ 0000h
SCANLADRH_ADRH_POSITION                  equ 0000h
SCANLADRH_ADRH_SIZE                      equ 0008h
SCANLADRH_ADRH_LENGTH                    equ 0008h
SCANLADRH_ADRH_MASK                      equ 00FFh

// Register: SCANCON0
#define SCANCON0 SCANCON0
SCANCON0                                 equ 01C98h
// bitfield definitions
SCANCON0_MD_POSN                         equ 0000h
SCANCON0_MD_POSITION                     equ 0000h
SCANCON0_MD_SIZE                         equ 0002h
SCANCON0_MD_LENGTH                       equ 0002h
SCANCON0_MD_MASK                         equ 0003h
SCANCON0_INTM_POSN                       equ 0003h
SCANCON0_INTM_POSITION                   equ 0003h
SCANCON0_INTM_SIZE                       equ 0001h
SCANCON0_INTM_LENGTH                     equ 0001h
SCANCON0_INTM_MASK                       equ 0008h
SCANCON0_DABORT_POSN                     equ 0004h
SCANCON0_DABORT_POSITION                 equ 0004h
SCANCON0_DABORT_SIZE                     equ 0001h
SCANCON0_DABORT_LENGTH                   equ 0001h
SCANCON0_DABORT_MASK                     equ 0010h
SCANCON0_BUSY_POSN                       equ 0005h
SCANCON0_BUSY_POSITION                   equ 0005h
SCANCON0_BUSY_SIZE                       equ 0001h
SCANCON0_BUSY_LENGTH                     equ 0001h
SCANCON0_BUSY_MASK                       equ 0020h
SCANCON0_SGO_POSN                        equ 0006h
SCANCON0_SGO_POSITION                    equ 0006h
SCANCON0_SGO_SIZE                        equ 0001h
SCANCON0_SGO_LENGTH                      equ 0001h
SCANCON0_SGO_MASK                        equ 0040h
SCANCON0_EN_POSN                         equ 0007h
SCANCON0_EN_POSITION                     equ 0007h
SCANCON0_EN_SIZE                         equ 0001h
SCANCON0_EN_LENGTH                       equ 0001h
SCANCON0_EN_MASK                         equ 0080h

